[
    {
        "id": 1,
        "title": "What It Means To Be A Gentleman Today",
        "content": "You hear it everywhere these days: the term “gent” or “gentleman” has become ubiquitous in men’s magazines, blogs, and conversations. Videos welcome “gentlemen” and everybody seems to use the word for a wide range of men.<br/><br/> A reader recently took us to task by saying that anything other than the traditional definition of a gentleman is a disappointment. Another claimed that a gentleman must have staff and would never cook for himself.<br/><br/>We couldn’t disagree more – the definition of a gentleman has changed and for the better. Prince Phillip, a textbook “gentleman” of wealth and position, is also famous for his potty mouth and racist gaffes. Are these gentlemanly behaviors? Certainly not.<br/><br/>Since the definition of a gentleman is so fundamental to what the Gentleman’s Gazette is, we thought it was time to outline how we see the gentleman today.<br/><br/><h3>The Original Gentleman</h3><br/>A hundred years ago, a gentleman was a man of high social position and wealth. Even today dictionaries still retain this definition, as well as several others:<br/><ol><li>A chivalrous, courteous, or honorable man.</li><li>A polite or formal way of referring to a man.</li><li>A man of noble birth attached to a royal household</li><li>A man of good social position, especially one of wealth and leisure</li><li>A courteous title for a male fellow member of the House of Commons or the House of Representatives</li></ol>",
        "contentForShortBlog": "You hear it everywhere these days: the term “gent” or “gentleman” has become ubiquitous in men’s magazines, blogs, and conversations.Videos welcome “gentlemen” and everybody seems to use the word for...",
        "images": {
            "large": "img/blog-1-veca.png",
            "small": "img/blog-1-manja.png"
        },
        "author": "Sven Raphael Schneider",
        "gender": "Male",
        "commentsCount": 0,
        "createdAt": "2024-03-01",
        "tags": [
            "men",
            "gentleman",
            "clothes"
        ]
    }
]